In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("Superstore.csv", encoding="ISO-8859-1")

In [4]:
df.head()
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [5]:
df = df.drop(columns=[
    "Row ID",
    "Order ID",
    "Customer ID",
    "Customer Name",
    "City",
    "Country",
    "Product ID",
    "Product Name"
])

In [7]:
df.head()

,Order Date,Ship Date,Ship Mode,Segment,State,Postal Code,Region,Category,Sub-Category,Sales,Quantity,Discount,Profit
0,11/8/2016,11/11/2016,Second Class,Consumer,Kentucky,42420,South,Furniture,Bookcases,261.9600,2,0.00,41.9136
1,11/8/2016,11/11/2016,Second Class,Consumer,Kentucky,42420,South,Furniture,Chairs,731.9400,3,0.00,219.5820
2,6/12/2016,6/16/2016,Second Class,Corporate,California,90036,West,Office Supplies,Labels,14.6200,2,0.00,6.8714
3,10/11/2015,10/18/2015,Standard Class,Consumer,Florida,33311,South,Furniture,Tables,957.5775,5,0.45,-383.0310
4,10/11/2015,10/18/2015,Standard Class,Consumer,Florida,33311,South,Office Supplies,Storage,22.3680,2,0.20,2.5164

In [10]:
df["Order Date"] = pd.to_datetime(df["Order Date"], dayfirst=False, errors="coerce")
df["Ship Date"] = pd.to_datetime(df["Ship Date"], dayfirst=False, errors="coerce")

In [11]:
df[["Order Date", "Ship Date"]].head(10)

  Order Date  Ship Date
0 2016-11-08 2016-11-11
1 2016-11-08 2016-11-11
2 2016-06-12 2016-06-16
3 2015-10-11 2015-10-18
4 2015-10-11 2015-10-18
5 2014-06-09 2014-06-14
6 2014-06-09 2014-06-14
7 2014-06-09 2014-06-14
8 2014-06-09 2014-06-14
9 2014-06-09 2014-06-14

In [12]:
df["Delivery Days"] = (df["Ship Date"] - df["Order Date"]).dt.days
df["Delivery Days"].head(10)

0    3
1    3
2    4
3    7
4    7
5    5
6    5
7    5
8    5
9    5
Name: Delivery Days, dtype: int64

In [13]:
df.head()

,Order Date,Ship Date,Ship Mode,Segment,State,Postal Code,Region,Category,Sub-Category,Sales,Quantity,Discount,Profit,Delivery Days
0,2016-11-08,2016-11-11,Second Class,Consumer,Kentucky,42420,South,Furniture,Bookcases,261.9600,2,0.00,41.9136,3
1,2016-11-08,2016-11-11,Second Class,Consumer,Kentucky,42420,South,Furniture,Chairs,731.9400,3,0.00,219.5820,3
2,2016-06-12,2016-06-16,Second Class,Corporate,California,90036,West,Office Supplies,Labels,14.6200,2,0.00,6.8714,4
3,2015-10-11,2015-10-18,Standard Class,Consumer,Florida,33311,South,Furniture,Tables,957.5775,5,0.45,-383.0310,7
4,2015-10-11,2015-10-18,Standard Class,Consumer,Florida,33311,South,Office Supplies,Storage,22.3680,2,0.20,2.5164,7

In [14]:
df.columns

Index(['Order Date', 'Ship Date', 'Ship Mode', 'Segment', 'State',
       'Postal Code', 'Region', 'Category', 'Sub-Category', 'Sales',
       'Quantity', 'Discount', 'Profit', 'Delivery Days'],
      dtype='object')

In [15]:
df["Unit Cost"] = (df["Sales"] - df["Profit"]) / df["Quantity"]

In [16]:
df[["Sales", "Profit", "Quantity", "Unit Cost"]].head()

      Sales    Profit  Quantity  Unit Cost
0  261.9600   41.9136         2   110.0232
1  731.9400  219.5820         3   170.7860
2   14.6200    6.8714         2     3.8743
3  957.5775 -383.0310         5   268.1217
4   22.3680    2.5164         2     9.9258

In [17]:

df["Order Month"] = df["Order Date"].dt.month


df["Order Year"] = df["Order Date"].dt.year

In [18]:
df["Order Month Name"] = df["Order Date"].dt.month_name()

In [19]:
df[["Order Date", "Order Month", "Order Year", "Order Month Name"]].head()

  Order Date  Order Month  Order Year Order Month Name
0 2016-11-08           11        2016         November
1 2016-11-08           11        2016         November
2 2016-06-12            6        2016             June
3 2015-10-11           10        2015          October
4 2015-10-11           10        2015          October

In [20]:
df.to_csv("cleaned_superstore.csv", index=False)